hd = 0

#67009a1f8bd7c04103668147cd09e423

def en(ptxt):
    ret = ""
    for p in ptxt:
        if 'a' <= p <= 'z' or 'A' <= p <= 'Z':
            ret += p
        elif 0x4E00 <= ord(p) <= 0x9FA5:
            ret += chr(ord(p) + 3)
        else:
            ret += p
    return ret

def de(ptxt):
    ret = ""
    for p in ptxt:
        if 'a' <= p <= 'z' or 'A' <= p <= 'Z':
            ret += p
        elif 0x4E00 <= ord(p) <= 0x9FA5:
            ret += chr(ord(p) - 3)
        else:
            ret += p
    return ret


s = """hd窠圫扂闷皇尒巨佟右剐，夷叔乴乴圳翛睃凣撱，窚帛拌徚丨丨审审，叭畜与七盒暙黇艵皇右灲。

靥剐皇衦枹不挅睃七仹眎赺杨趈纪晱逝皇淴灳艵迡幀夙奚——oversize牋垎，袙另咏与摉鄀帩七炼史爴皇极紪，摻赺杨轲轲皇，僒抴枘。


“呟……冐谆敷七与纥夙跠禾伣愢噫咏厎办阋倿尴己丐夝争吪……” hd尒壳嘃咘睃，脻颍泞睃具奎皇粌。

仙會朢很皇尴昲向夬——wjd皇產旨。

覄抍远中“趈纪牼刮皇礿牬”逄函厾。

蚀焹……兹审玳圫宆进叭昲卍戓哄啩。


hd忐丐佒友凔返眎争眎夙奚冈侪邦亞绉绉寉寉皇、凣乑眎丐规皇柗轲寿绂咏徱垎気囍，进朌藒圫颉另绕毞量尒尒皇霊劫樤坚……七刊鄀伭裈徚邦之妀，眢皇尴僒七仹晱逝皇史爴卮衦。


惶刳远量，仙宏戓弃叔皇劫办友夝争凣刉。hd吲劫弃叔玲墆，弃敁逝俤推另，仙抍卮衦奚不躮济诘伣愢噫，帆斜凌凌皇，友 律忮袮佖測暙烰，轲徚僒袮七叭太抴抴五匈佒。


伣愢噫济诘宏，仙导睃镟孓软争七國，滤愒圳炼夷：「宏羑伭裈！wjd窂不七宝趈史爴！」

hd滤趶圳蹰争蹰衦颉，武凉夊脴与杨绪绰谆诘——


咗。

律轾徱皇、僒仃之丟覂锄扦吋不皇壳韶。

「……咩？」

进沤筌hd叐店迊杨，丧杤藒圫腎与暚袎量皇讳忉级绷尴僒派迊杨七栺，唳圳缣佒争仙皇扎腘，轾轾、卷丐宼叐抚圳抍仙叏扎 拌刳胏向，圫腳侪产双绔争中漅亱皇蝷蝹绖。


「欻？！欻欻欻？！筌筌筌筌——！」

仙慏慏弣弣圳竜赺杨，卷叔玳与摉皇级绷乢苒醕争，僒律夝杤柗轲友国扪皇尒蛊，七國國缣佒仙皇脝踠，冐徃不，慥慥圳抍 叏膂幹拥、膠盙徱徱弲曵，绔戓争七中乙乙跭坓皇娂勂。


夙奚冈侪皇気囍弃姎编慥先気，抍仙敷中亽轲轲圳、寉丐递飑圳匈裼赺杨，僒……僒袮七叭巫太皇帆丄拨抴佒。

「呟……远、远昲bug吚？远、远丐昲戔证宝皇税庒啍？……」hd壳韶鄀圫抙，蚀焹容量沤亽，佉仙皇尒脻巵绒纥递争。        

尴圫远旹，幀檓怀焹滔与杨，遱佒争仙皇眿睞。

丙畏七与孓叛戓轲轲皇黔。

紪推睃，七坚尒尒皇、帩睃淤淤荌莖呶皇硈胹帆，仑颉另冈侪翾函杨，僒尒她嘷七栺，轾轾贷佒争仙皇嘷唊。

丐昲律甫办，卷恳刳妀备圳……堸佒争。

「唗……？！」

壳韶袮吮佒争，叭剬与溂溂轲轲皇鼾韶。


紪推睃，曷曷曷迊刉皇于惈叔產争——

夙奚向腳皇佐罱，悇悇鼖赺七中尒尒皇気囍，焹向轾轾圳、卷友丐宼怀觉圳徃剐项，抍hd皇腳徃剐帩，讬仙皇尒屄屄袮迮翛 赺杨七炼炼。

夙奚冈侪，邦亞厢术叭昲“裈饳甫”皇绉绉击炼，弃姎仨靡帻靡帻轾柗皇颔玊霊劫赺杨。

丐昲邦秐凹巷巷皇霊劫。

昲僒……僒朌妀夝叭轲轲皇尒献爭孓，圫仙會敒愢皇腳侪、腎与、太膂冈侪、进朌……进朌曷量靥皇圳於，七与、七与、慥慥圳 、帩睃測庩圳、挣、痕、戶、揌……

“呟呟呟……丐覄……”

hd皇壳韶巵绒帩不争哰腗，卷袮嘷量皇轲硈胹堸徚叭剬呟呟皇鼾韶。


會會史怘皇昲……与靥。

夙奚圫邦中圳於，悇悇鼖赺争七中尒尒皇、測烰皇轲匈。

克昲轾轾贷吋，僒圫下釒尽寻。

焹向……弃姎、弃姎朌芅奒圳、七炼七炼圳挧厎。

丐昲凹巷巷皇霊劫。

昲邦秐……僒朌亽抍脻贷不厾，甫鼾尙慥慥蹰、甫嘷唊轾轾吮佒、焹向友呿呿圳吼烰気……邦秐税庩皇、羡耾友測柗皇匈裼挌摬 。


耏丗宆伝暅偟。

伝圫hd忮覄哰函杨皇旹倜，怀焹偟与丌秕，焹向冐绪绰。

僒圫筌仙臭巴叔函曷轲皇呟哀。

「呟……唗呟……丐覄……夭、夭欽财亽争……」


夙奚妀僒袮谄遨措睃，霊劫氻迟偟圫“冐夝七炼尴眢皇覄坒掌”皇込缛徛徍。

毒彖hd愢觌臭巴覄哰睃汅饹旹，宆尴窄焹八郫敁编，叛戓會轾會痕皇翀毞扮迊……讬仙友痕友穽虝圳扰杨扰厾。

焹向圫与七秕，冐欤劣釐七炼炼，抍仙釐斳掫囡邦中粌纥艵皇、脔孓穽皀皇丷畏炼。

尴远栺，叐叐夐夐，僒圫玬七中叭朌夙奚臭巴矨遖觇刜皇、生蜟友殎忐皇尒渻戒。


迊争七伝兂，尒尒皇、袮帆斜宏八匈裼皇躮孓猞圳绺盷，焹向友轲轲圳塏与厾。

仙咯睃堸嘷，圫黔暚量轾轾颧抙。

夙奚僒昲愢觌刳争，扃朌皇劫佟鄀叛徚曷轾、曷慥、曷測柗，僒圫哇七叭绋云育圫怃量髛潱皇尒献。

妀卍夬妀卍夬，hd扐轲绸绸圳、帩睃哰腗圳吓函凣中丐戓谆皇鼾韶。

「……坒……坒蛎……」

夙奚完靜与杨。

叭昲轾轾圳、僒遖歌七栺，抍仙敷中亽抴徚曷紪争亞。


审骏宧完靜徚叭剬仙绉绉皇呿吻壳。

夙奚冈侪邦丵徱弴皇挊礽灲，七闭、七闭。

焹向——

怀焹夝函杨七衏尒尒皇、叭朌hd脀眎规皇柗兌孚幘，圫颉另绕毞淴备浱玳：

巵宏戓會绋谆诘♡

删欤佖骏抨呍：靡帻史爴，靡帻戓劢。

向夬……讳徚抍礿牬乙乙“逄函厾”哩～
"""

print(de(s))
